robertlipe/svdtoheaders/demo/h/ch32v103_map.h
#define CH32V103_ADC_BASE    0x40012400 /* 0x40012400-0x400127ff: 1kB Analog to digital converter */
#define CH32V103_AFIO_BASE   0x40010000 /* 0x40010000-0x400103ff: 1kB Alternate function I/O */
#define CH32V103_BKP_BASE    0x40006c00 /* 0x40006c00-0x40006fff: 1kB Backup registers */
#define CH32V103_CRC_BASE    0x40023000 /* 0x40023000-0x400233ff: 1kB CRC calculation unit */
#define CH32V103_DAC1_BASE   0x40007400 /* 0x40007400-0x400077ff: 1kB Digital to analog converter */
#define CH32V103_DBG_BASE    0xe0042000 /* 0xe0042000-0xe00423ff: 1kB Debug support */
#define CH32V103_DMA_BASE    0x40020000 /* 0x40020000-0x400203ff: 1kB DMA controller */
#define CH32V103_EXTEND_BASE 0x40023800 /* 0x40023800-0x40023fff: 2kB extension configuration */
#define CH32V103_EXTI_BASE   0x40010400 /* 0x40010400-0x400107ff: 1kB EXTI */
#define CH32V103_FLASH_BASE  0x40022000 /* 0x40022000-0x400223ff: 1kB FLASH */
#define CH32V103_GPIOA_BASE  0x40010800 /* 0x40010800-0x40010bff: 1kB General purpose I/O */
#define CH32V103_GPIOB_BASE  0x40010c00 /* 0x40010c00-0x40010fff: 1kB GPIOB */
#define CH32V103_GPIOC_BASE  0x40011000 /* 0x40011000-0x400113ff: 1kB GPIOC */
#define CH32V103_GPIOD_BASE  0x40011400 /* 0x40011400-0x400117ff: 1kB GPIOD */
#define CH32V103_I2C1_BASE   0x40005400 /* 0x40005400-0x400057ff: 1kB Inter integrated circuit */
#define CH32V103_I2C2_BASE   0x40005800 /* 0x40005800-0x40005bff: 1kB I2C2 */
#define CH32V103_IWDG_BASE   0x40003000 /* 0x40003000-0x400033ff: 1kB Independent watchdog */
#define CH32V103_PFIC_BASE   0xe000e000 /* 0xe000e000-0xe000f0ff: 4kB Programmable Fast Interrupt Controller */
#define CH32V103_PWR_BASE    0x40007000 /* 0x40007000-0x400073ff: 1kB Power control */
#define CH32V103_RCC_BASE    0x40021000 /* 0x40021000-0x400213ff: 1kB Reset and clock control */
#define CH32V103_RTC_BASE    0x40002800 /* 0x40002800-0x40002bff: 1kB Real time clock */
#define CH32V103_SPI1_BASE   0x40013000 /* 0x40013000-0x400133ff: 1kB Serial peripheral interface */
#define CH32V103_SPI2_BASE   0x40003800 /* 0x40003800-0x40003bff: 1kB SPI2 */
#define CH32V103_TIM1_BASE   0x40012c00 /* 0x40012c00-0x40012fff: 1kB Advanced timer */
#define CH32V103_TIM2_BASE   0x40000000 /* 0x40000000-0x400003ff: 1kB General purpose timer */
#define CH32V103_TIM3_BASE   0x40000400 /* 0x40000400-0x400007ff: 1kB TIM3 */
#define CH32V103_TIM4_BASE   0x40000800 /* 0x40000800-0x40000bff: 1kB TIM4 */
#define CH32V103_USART1_BASE 0x40013800 /* 0x40013800-0x40013bff: 1kB Universal synchronous asynchronous receiver transmitter */
#define CH32V103_USART2_BASE 0x40004400 /* 0x40004400-0x400047ff: 1kB USART2 */
#define CH32V103_USART3_BASE 0x40004800 /* 0x40004800-0x40004bff: 1kB USART3 */
#define CH32V103_USBD_BASE   0x40005c00 /* 0x40005c00-0x40005fff: 1kB Universal serial bus full-speed device interface */
#define CH32V103_USBHD_BASE  0x40023400 /* 0x40023400-0x400237ff: 1kB USB register */
#define CH32V103_WWDG_BASE   0x40002c00 /* 0x40002c00-0x40002fff: 1kB Window watchdog */
